from math import pi, sin
from python_shared_lib.openNetwork import *
m = MediatorUDP(remote="192.168.0.109")

# -------------------------------------------------------- #
#                            設定                          #
# -------------------------------------------------------- #
T = 5  # 周期[sec]
c = (78/10/1000)/(2*pi)  # [m/rad] -> 1回転で進む距離は2*pi*c
L = 0.1   # 変位の振幅 [m]
n = 6400  # ドライバーに書いてある1回転に必要なステップ数 [step/rotation]

# -------------------------------------------------------- #
a = L*n/(2*T*c)  # f = a*sin(w*t) [Hz] の a
# m({"freq": 1600})
print("最大速度", c*a*2.*pi/n)

# -------------------------------------------------------- #
#                            命令                           #
# -------------------------------------------------------- #
# m({"freq": 1000})
m({"start_cos_wave": (a, T)})
# m({"start_sin_wave": (a, T)})
